In [1]:
import pandas as pd
from sqlalchemy import create_engine
import csv
df = pd.read_csv('1NF_ABC_FOODMART_new.csv')

In [2]:
df

,location_name,address,city,state,zip_code,employee_first_name,employee_last_name,employee_email,employee_phone,employee_position,...,quantity_sold,unit_price,transaction_type,transaction_amount,transaction_date,expense_date,expense_description,expense_amount,quantity_on_shelf,shelf_name
0,Queens #1,123 Main St,Queens,NY,11111,John,Doe,john.doe@email.com,555-123-4567,Manager,...,5,0.75,Debit,15.75,11/1/2023,11/1/2023,Utility Bill,500,100,A-1
1,Queens #2,456 Elm St,Queens,NY,22222,Jane,Smith,jane.smith@email.com,555-234-5678,Cashier,...,3,2.50,Debit,3.50,11/2/2023,11/2/2023,Cleaning Supplies,75,50,A-2
2,Brooklyn #1,789 Oak St,Brooklyn,NY,33333,Mike,Johnson,mike.johnson@email.com,555-345-6789,Cashier,...,2,1.75,Credit,45.75,11/2/2023,11/3/2023,Rent,1500,25,B-1
3,Brooklyn #2,101 Pine St,Brooklyn,NY,44444,Sarah,Lee,sarah.lee@email.com,555-456-7890,Manager,...,1,5.50,Debit,7.50,11/3/2023,11/4/2023,Advertising,250,20,B-2
4,Brooklyn #3,202 Maple St,Brooklyn,NY,55555,David,Brown,david.brown@email.com,555-567-8901,Cashier,...,4,1.25,Debit,75.00,11/4/2023,11/5/2023,Repairs,300,80,C-1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 44 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location_name        5 non-null      object
 1   address              5 non-null      object
 2   city                 5 non-null      object
 3   state                5 non-null      object
 4   zip_code             5 non-null      int64
 5   employee_first_name  5 non-null      object
 6   employee_last_name   5 non-null      object
 7   employee_email       5 non-null      object
 8   employee_phone       5 non-null      object
 9   employee_position    5 non-null      object
 10  shift_date           5 non-null      object
 11  shift_start_time     5 non-null      object
 12  shift_end_time       5 non-null      object
 13  hourly_wage          5 non-null      int64
 14  item_name            5 non-null      object
 15  description          5 non-null      object
 16  category_name        5 non-null      object
 17  cost_price           5 non-null      float64
 18  retail_price         5 non-null      float64
 19  quantity_in_stock    5 non-null      int64
 20  supplier_name        5 non-null      object
 21  contact_name         5 non-null      object
 22  contact_phone        5 non-null      object
 23  contact_email        5 non-null      object
 24  delivery_date        5 non-null      object
 25  quantity_delivered   5 non-null      int64
 26  delivery_unit_price  5 non-null      float64
 27  sale_date            5 non-null      object
 28  total_amount         5 non-null      float64
 29  customer_first_name  5 non-null      object
 30  customer_last_name   5 non-null      object
 31  customer_email       5 non-null      object
 32  customer_phone       5 non-null      object
 33  customer_address     5 non-null      object
 34  quantity_sold        5 non-null      int64
 35  unit_price           5 non-null      float64
 36  transaction_type     5 non-null      object
 37  transaction_amount   5 non-null      float64
 38  transaction_date     5 non-null      object
 39  expense_date         5 non-null      object
 40  expense_description  5 non-null      object
 41  expense_amount       5 non-null      int64
 42  quantity_on_shelf    5 non-null      int64
 43  shelf_name           5 non-null      object
dtypes: float64(6), int64(7), object(31)
memory usage: 1.8+ KB

In [4]:
#assign connection to variable
conn = 'postgresql://postgres:123@localhost/ABCFOODMART'

In [5]:
#create engine to connect to database
engine = create_engine(conn)

In [6]:
#connection
connection = engine.connect()

In [9]:
#SQL statements to create all tables in the schema
sql_statement = """
    CREATE TABLE locations (
        location_id INTEGER,
        location_name VARCHAR(50) NOT NULL,
        address VARCHAR(100) NOT NULL,
        city VARCHAR(50) NOT NULL,
        state CHAR(2) NOT NULL,
        zip_code CHAR(5),
        PRIMARY KEY (location_id));

    CREATE TABLE suppliers (
        supplier_id INTEGER,
        supplier_name VARCHAR(50) NOT NULL,
        contact_name VARCHAR(50) NOT NULL,
        contact_phone VARCHAR(20) NOT NULL,
        contact_email VARCHAR(100) NOT NULL,
        PRIMARY KEY (supplier_id));

    CREATE TABLE customers (
        customer_id INTEGER,
        customer_first_name VARCHAR(20) NOT NULL,
        customer_last_name VARCHAR(20) NOT NULL,
        customer_email VARCHAR(100) NOT NULL,
        customer_phone VARCHAR(20) NOT NULL,
        customer_address VARCHAR(100) NOT NULL,
        PRIMARY KEY (customer_id));

    CREATE TABLE categories (
        category_id INTEGER,
        category_name VARCHAR NOT NULL,
        PRIMARY KEY (category_id));

    CREATE TABLE employees (
        employee_id INTEGER,
        employee_first_name VARCHAR(20) NOT NULL,
        employee_last_name VARCHAR(20) NOT NULL,
        employee_email VARCHAR(100) NOT NULL,
        employee_phone VARCHAR(20) NOT NULL,
        employee_position VARCHAR(50) NOT NULL,
        location_id INTEGER NOT NULL,
        PRIMARY KEY (employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE inventory_items (
        item_id INTEGER,
        item_name VARCHAR(50) NOT NULL,
        description TEXT NOT NULL,
        category_id INTEGER NOT NULL,
        supplier_id INTEGER NOT NULL,
        cost_price DECIMAL(4,2) NOT NULL,
        retail_price DECIMAL(4,2) NOT NULL,
        quantity_in_stock INTEGER NOT NULL,
        PRIMARY KEY (item_id),
        FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id),
        FOREIGN KEY (category_id) REFERENCES categories(category_id));

    CREATE TABLE deliveries (
        delivery_id INTEGER,
        item_id INTEGER NOT NULL,
        supplier_id INTEGER NOT NULL,
        delivery_date DATE NOT NULL,
        quantity_delivered INTEGER NOT NULL,
        delivery_unit_price DECIMAL(6,2) NOT NULL,
        PRIMARY KEY (delivery_id),
        FOREIGN KEY (item_id) REFERENCES inventory_items(item_id),
        FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id));

    CREATE TABLE sales (
        sale_id INTEGER,
        employee_id INTEGER NOT NULL,
        sale_date DATE NOT NULL,
        total_amount DECIMAL(6,2) NOT NULL,
        location_id INTEGER NOT NULL,
        PRIMARY KEY (sale_id),
        FOREIGN KEY (employee_id) REFERENCES employees(employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE transactions (
        transaction_id INTEGER,
        sale_id INTEGER NOT NULL,
        customer_id INTEGER NOT NULL,
        PRIMARY KEY (transaction_id),
        FOREIGN KEY (sale_id) REFERENCES sales(sale_id),
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id));

    CREATE TABLE transaction_items (
        transaction_item_id INTEGER,
        transaction_id INTEGER NOT NULL,
        item_id INTEGER NOT NULL,
        quantity_sold SMALLINT NOT NULL,
        unit_price DECIMAL(6, 2) NOT NULL,
        PRIMARY KEY (transaction_item_id),
        FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id),
        FOREIGN KEY (item_id) REFERENCES inventory_items(item_id));

    CREATE TABLE accounting (
        accounting_id INTEGER,
        transaction_id INTEGER NOT NULL,
        transaction_type CHAR(6) NOT NULL,
        transaction_amount DECIMAL(8, 2) NOT NULL,
        transaction_date DATE NOT NULL,
        PRIMARY KEY (accounting_id),
        FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id),
        CHECK (transaction_type IN ('Debit', 'Credit')));

    CREATE TABLE expenses (
        expense_id INTEGER,
        location_id INTEGER NOT NULL,
        expense_date DATE NOT NULL,
        expense_description VARCHAR NOT NULL,
        expense_amount DECIMAL(8, 2) NOT NULL,
        PRIMARY KEY (expense_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE shelves (
        shelf_id INTEGER,
        location_id INTEGER NOT NULL,
        shelf_name VARCHAR NOT NULL,
        PRIMARY KEY (shelf_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE shelf_contents (
        shelf_content_id INTEGER,
        shelf_id INTEGER NOT NULL,
        item_id INTEGER NOT NULL,
        quantity_on_shelf SMALLINT NOT NULL,
        PRIMARY KEY (shelf_content_id),
        FOREIGN KEY (shelf_id) REFERENCES shelves(shelf_id),
        FOREIGN KEY (item_id) REFERENCES inventory_items(item_id));

    CREATE TABLE employee_shifts (
        employee_id INTEGER,
        location_id INTEGER NOT NULL,
        shift_date DATE NOT NULL,
        shift_end_time TIME NOT NULL,
        shift_start_time TIME NOT NULL,
        hourly_wage DECIMAL(6,2) NOT NULL,
        PRIMARY KEY (employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));
"""

In [10]:
#execute sql statement above
connection.execute(sql_statement)

In [11]:
#create location df
locations = df[['location_name', 'address', 'city', 'state', 'zip_code']].drop_duplicates(subset=['location_name']).dropna(subset=['location_name'])
locations.insert(0, 'location_id', range(1, 1 + len(locations)))
locations

   location_id location_name       address      city state  zip_code
0            1     Queens #1   123 Main St    Queens    NY     11111
1            2     Queens #2    456 Elm St    Queens    NY     22222
2            3   Brooklyn #1    789 Oak St  Brooklyn    NY     33333
3            4   Brooklyn #2   101 Pine St  Brooklyn    NY     44444
4            5   Brooklyn #3  202 Maple St  Brooklyn    NY     55555

In [12]:
#push location df to sql
locations.to_sql('locations',con=engine, if_exists='append', index=False)

5

In [13]:
#create suppliers df
suppliers = df[['supplier_name', 'contact_name', 'contact_phone', 'contact_email']].drop_duplicates(subset=['supplier_name']).dropna(subset=['supplier_name'])
suppliers.insert(0, 'supplier_id', range(1, 1 + len(suppliers)))
suppliers

,supplier_id,supplier_name,contact_name,contact_phone,contact_email
0,1,Fresh Farms,John Supplier,555-111-1111,john@freshfarms.com
1,2,Dairy Delights,Mary Contact,555-222-2222,mary@dairydelights.com
2,3,Golden Bakery,Robert Baker,555-333-3333,robert@goldenbakery.com
3,4,Quality Meats,Susan Meats,555-444-4444,susan@qualitymeats.com
4,5,Veggie World,Mark Green,555-555-5555,mark@veggieworld.com

In [14]:
#push suppliers df to sql
suppliers.to_sql('suppliers',con=engine, if_exists='append', index=False)

5

In [15]:
#create customers df
customers = df[['customer_first_name','customer_last_name','customer_email','customer_phone','customer_address']]
customers.insert(0, 'customer_id', range(1, 1 + len(customers)))
customers

,customer_id,customer_first_name,customer_last_name,customer_email,customer_phone,customer_address
0,1,John,Smith,john.smith@email.com,555-111-1111,"123 Main St, Apt 101"
1,2,Sarah,Johnson,sarah.johnson@email.com,555-222-2222,"456 Elm St, Apt 202"
2,3,David,Lee,david.lee@email.com,555-333-3333,"789 Oak St, Apt 303"
3,4,Mary,Brown,mary.brown@email.com,555-444-4444,"101 Pine St, Apt 404"
4,5,Laura,Wilson,laura.wilson@email.com,555-555-5555,"202 Maple St, Apt 505"

In [16]:
#push customers df to sql
customers.to_sql('customers',con=engine, if_exists='append', index=False)

5

In [17]:
#create categories df
categories = df[['category_name']].drop_duplicates()
categories.insert(0, 'category_id', range(1, 1 + len(categories)))
categories

   category_id category_name
0            1        Fruits
1            2         Dairy
2            3        Bakery
3            4          Meat
4            5    Vegetables

In [18]:
#push categories df to sql
categories.to_sql('categories',con=engine, if_exists='append', index=False)

5

In [19]:
#create employees df
df = pd.merge(df, locations[['location_name', 'location_id']], how='left', on='location_name')
employees = df[['employee_first_name', 'employee_last_name', 'employee_email', 'employee_phone', 'employee_position', 'location_id']].drop_duplicates(subset=['employee_first_name', 'employee_last_name']).dropna(subset=['employee_first_name', 'employee_last_name'])
employees.insert(0, 'employee_id', range(1, 1 + len(employees)))
employees

,employee_id,employee_first_name,employee_last_name,employee_email,employee_phone,employee_position,location_id
0,1,John,Doe,john.doe@email.com,555-123-4567,Manager,1
1,2,Jane,Smith,jane.smith@email.com,555-234-5678,Cashier,2
2,3,Mike,Johnson,mike.johnson@email.com,555-345-6789,Cashier,3
3,4,Sarah,Lee,sarah.lee@email.com,555-456-7890,Manager,4
4,5,David,Brown,david.brown@email.com,555-567-8901,Cashier,5

In [20]:
#push employees to sql
employees.to_sql('employees',con=engine, if_exists='append', index=False)

5

In [21]:
#create inventory_items df
df = pd.merge(df, categories[['category_name', 'category_id']], how='left', on='category_name')
df = pd.merge(df, suppliers[['supplier_name', 'supplier_id']], how='left', on='supplier_name')
inventory_items = df[['item_name', 'description', 'category_id', 'supplier_id', 'cost_price', 'retail_price', 'quantity_in_stock']].drop_duplicates(subset=['item_name']).dropna(subset=['item_name'])
inventory_items.insert(0, 'item_id', range(1, 1 + len(inventory_items)))
inventory_items

,item_id,item_name,description,category_id,supplier_id,cost_price,retail_price,quantity_in_stock
0,1,Apples,Fresh red apples,1,1,0.50,0.75,1000
1,2,Milk,Fresh whole milk,2,2,2.00,2.50,500
2,3,Bread,Whole wheat bread,3,3,1.25,1.75,300
3,4,Chicken,Boneless chicken,4,4,4.00,5.50,200
4,5,Lettuce,Fresh green lettuce,5,5,0.75,1.25,800

In [22]:
#push inventory_items df to sql
inventory_items.to_sql('inventory_items',con=engine, if_exists='append', index=False)

5

In [23]:
#create deliveries df
df = pd.merge(df, inventory_items[['item_name', 'item_id']], how='left', on='item_name')
deliveries = df[['item_id','supplier_id','delivery_date','quantity_delivered','delivery_unit_price']]
deliveries.insert(0, 'delivery_id', range(1, 1 + len(deliveries)))
deliveries

,delivery_id,item_id,supplier_id,delivery_date,quantity_delivered,delivery_unit_price
0,1,1,1,11/1/2023,1000,0.45
1,2,2,2,11/2/2023,500,1.90
2,3,3,3,11/3/2023,300,1.10
3,4,4,4,11/4/2023,200,3.75
4,5,5,5,11/5/2023,800,0.70

In [24]:
#push deliveries df to sql
deliveries.to_sql('deliveries',con=engine, if_exists='append', index=False)

5

In [25]:
#create sales df
df = pd.merge(df, employees[['employee_email', 'employee_id']], how='left', on='employee_email')
sales = df[['employee_id','sale_date','total_amount','location_id']]
sales.insert(0, 'sale_id', range(1, 1 + len(sales)))
sales

   sale_id  employee_id  sale_date  total_amount  location_id
0        1            1  11/1/2023        100.50            1
1        2            2  11/2/2023         45.75            2
2        3            3  11/3/2023         30.25            3
3        4            4  11/4/2023         75.00            4
4        5            5  11/5/2023         60.90            5

In [26]:
#push sales df to sql
sales.to_sql('sales',con=engine, if_exists='append', index=False)

5

In [27]:
#create transactions df
df = pd.merge(df, sales[['employee_id', 'sale_date', 'total_amount', 'location_id', 'sale_id']], how='left', on=['employee_id', 'sale_date', 'total_amount', 'location_id'])
df = pd.merge(df, customers[['customer_email', 'customer_id']], how='left', on='customer_email')
transactions = df[['sale_id','customer_id']]
transactions.insert(0, 'transaction_id', range(1, 1 + len(transactions)))
transactions

   transaction_id  sale_id  customer_id
0               1        1            1
1               2        2            2
2               3        3            3
3               4        4            4
4               5        5            5

In [28]:
#push transactions df to sql
transactions.to_sql('transactions',con=engine, if_exists='append', index=False)

5

In [29]:
#create transaction_items df
df = pd.merge(df, transactions[['sale_id', 'customer_id', 'transaction_id']], how='left', on=['sale_id', 'customer_id'])
transaction_items = df[['transaction_id',  'item_id', 'quantity_sold', 'unit_price']]
transaction_items.insert(0, 'transaction_item_id', range(1, 1 + len(transaction_items)))
transaction_items

   transaction_item_id  transaction_id  item_id  quantity_sold  unit_price
0                    1               1        1              5        0.75
1                    2               2        2              3        2.50
2                    3               3        3              2        1.75
3                    4               4        4              1        5.50
4                    5               5        5              4        1.25

In [30]:
#push transaction_items df to sql
transaction_items.to_sql('transaction_items',con=engine, if_exists='append', index=False)

5

In [31]:
#create accounting df
accounting = df[['transaction_id', 'transaction_type','transaction_amount','transaction_date']]
accounting.insert(0, 'accounting_id', range(1, 1 + len(accounting)))
accounting

,accounting_id,transaction_id,transaction_type,transaction_amount,transaction_date
0,1,1,Debit,15.75,11/1/2023
1,2,2,Debit,3.50,11/2/2023
2,3,3,Credit,45.75,11/2/2023
3,4,4,Debit,7.50,11/3/2023
4,5,5,Debit,75.00,11/4/2023

In [32]:
#push accounting df to sql
accounting.to_sql('accounting',con=engine, if_exists='append', index=False)

5

In [33]:
#create expenses df
expenses = df[['location_id','expense_date','expense_description','expense_amount']]
expenses.insert(0, 'expense_id', range(1, 1 + len(expenses)))
expenses

   expense_id  location_id expense_date expense_description  expense_amount
0           1            1    11/1/2023        Utility Bill             500
1           2            2    11/2/2023   Cleaning Supplies              75
2           3            3    11/3/2023                Rent            1500
3           4            4    11/4/2023         Advertising             250
4           5            5    11/5/2023             Repairs             300

In [34]:
#push expenses df to sql
expenses.to_sql('expenses',con=engine, if_exists='append', index=False)

5

In [35]:
#create shelves
shelves = df[['location_id', 'shelf_name']].drop_duplicates(subset=['shelf_name']).dropna(subset=['shelf_name'])
shelves.insert(0, 'shelf_id', range(1, 1 + len(shelves)))         
shelves

   shelf_id  location_id shelf_name
0         1            1        A-1
1         2            2        A-2
2         3            3        B-1
3         4            4        B-2
4         5            5        C-1

In [36]:
#push shelves df to sql
shelves.to_sql('shelves',con=engine, if_exists='append', index=False)

5

In [37]:
#create shelf_contents df
df = pd.merge(df, shelves[['location_id', 'shelf_name', 'shelf_id']], how='left', on=['location_id', 'shelf_name'])
shelf_contents = df[['shelf_id', 'item_id','quantity_on_shelf']]
shelf_contents.insert(0, 'shelf_content_id', range(1, 1 + len(shelf_contents))) 
shelf_contents

   shelf_content_id  shelf_id  item_id  quantity_on_shelf
0                 1         1        1                100
1                 2         2        2                 50
2                 3         3        3                 25
3                 4         4        4                 20
4                 5         5        5                 80

In [38]:
#push shelf_contents df to sql
shelf_contents.to_sql('shelf_contents',con=engine, if_exists='append', index=False)

5

In [39]:
#create employee_shifts df
employee_shifts = df[['employee_id', 'shift_date',  'shift_start_time', 'shift_end_time', 'hourly_wage', 'location_id']]
employee_shifts

,employee_id,shift_date,shift_start_time,shift_end_time,hourly_wage,location_id
0,1,11/26/2023,7:00,19:00,20,1
1,2,11/26/2023,7:00,13:00,25,2
2,3,11/26/2023,13:00,19:00,22,3
3,4,11/26/2023,7:00,19:00,18,4
4,5,11/26/2023,7:00,13:00,20,5

In [40]:
#push employee_shifts to sql
employee_shifts.to_sql('employee_shifts',con=engine, if_exists='append', index=False)

5